export const CURRENCY = ["IRR"] as const;
export const SENDING_METHODS = {
  storeSend: "ارسال توسط فروشگاه",
  personReception: "دریافت حضوری",
} as const;
export type SendingMethodKey = keyof typeof SENDING_METHODS;
export type SendingMethodValue = (typeof SENDING_METHODS)[SendingMethodKey];

export const BRAND_DATA = {
  phoneNumber: "0912 158 2449",
  address: {
    location: { lan: 1, lat: 3 },
    plain: "تهران ، نعمت آباد ، خیابان نور ، پلاک 43",
  },
} as const;

export const USER_ROLES = ["admin", "customer", "moderator"] as const;
export type Role = (typeof USER_ROLES)[number];
export const USER_ROLES_DICTIONARY: Record<Role, string> = {
  admin: "مدیر اصلی",
  customer: "مشتری",
  moderator: "فروشنده",
};

export const GATEWAYS = ["zarinpal", "saman"] as const;
export type PaymentGatewayKeys = (typeof GATEWAYS)[number];

export const TERMS_CONDITIONS = `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز ، و کاربردهای مدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز ، و کاربردهای مد  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز ، و کاربردهای مد  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است.  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز ، و کاربردهای مدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز ، و کاربردهای مد  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است`;
